import Waterfall from "@/components/Waterfall.tsx";

function App() {
  return (
    <Waterfall column={3} gap={20 + "px"}>
      <div>
        图片1图片1图片图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片11图片1图片1
      </div>
      <div>
        图片
        图片1图片1图片图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图
        图片1图片1图片图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图
        图片1图片1图片图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图
        图片1图片1图片图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图
        图片1图片1图片图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图
        图片1图片1图片图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图
        图片1图片1图片图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图2
      </div>
      <div>图片3</div>
      <div>图片4</div>
      <div>
        图片1图片1图片图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片11图片1图片1
      </div>
      <div>
        图片
        图片1图片1图片图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图
        图片1图片1图片图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图
        图片1图片1图片图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图
        图片1图片1图片图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图
        图片1图片1图片图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图
        图片1图片1图片图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图
        图片1图片1图片图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图片1图2
      </div>
      <div>图片3</div>
      <div>图片4</div>
    </Waterfall>
  );
}

export default App;
